const express = require("express"); //1. імпортуємо express

// 2. Щоб запустити express (express - об'єкт, який може створити веб-сервер і щось інше), потрібно викликати його як фунцію, яка і поверне веб-сервер
const app = express(); // app - веб-сервер.

// 4. якщо прийде get запит на адресу "/", виконай цю функцію
// в функцію експресс передає два аргументи: 1. об'єкт request - це вся інфо про запит, який прийшов(тіло, адреса, метод),
// response - об'єкт, який допомагає налаштувати і відправити відповідь
// щоб відправити відповідь використаємо метод send, в який можна вставити html розмітку або якийсь об'єкт чи масив
// можна використати тільки один send у функції, друга вже не спрацює і буде помилка
// send відправляє відповідь на фронтенд
app.get("/", (request, response)=> {
    response.send("<h2>Home page</h2>");
});

// 4. якщо прийде get запит на адресу "/contacts" виконай цю функцію
app.get("/contacts", (request, response)=> {
    console.log(request.url);
    console.log(request.method);
    response.send("<h2>Contacts page</h2>");
})

//3. Щоб зупустити веб-сервер потрібно викликати в app метод listen, першим аргументом передати порт
// якщо одночасно пишите фрот і бек, то порти повинні бути різними інакше буде конфлікт
// щоб перевірити, що веб сервер працює другим аргументом використовуємо колбек функцію, яка спрацьовує, коли
// вeб-сервер буде запущений

app.listen(3000, () => console.log("Server running")); 